package kyle.leis.eo.finance.billrecord.test;

import java.math.BigDecimal;
import java.util.List;

import kyle.common.connectors.util.Decoder;
import kyle.common.util.jlang.StringUtility;
import kyle.leis.eo.billing.receivable.da.ReceivableforbillCondition;
import kyle.leis.eo.billing.receivable.dax.ReceivableDemand;
import kyle.leis.eo.finance.billrecord.bl.BillRecordAmountTH;
import kyle.leis.eo.finance.billrecord.da.BillrecordColumns;
import kyle.leis.eo.finance.billrecord.da.BillrecordCondition;
import kyle.leis.eo.finance.billrecord.dax.BillRecordDemand;
import kyle.leis.eo.finance.billrecord.sv.BillRecordService;

public class BillRecordTest {
	private static BillRecordService s_objBillRecordService = new BillRecordService();
	public static void main(String[] args) {
		try {
//			saveByFee();
			//saveByFee2();
			//query();
			System.out.println(sumActualTotal());
		} catch (Exception ex) {
			ex.printStackTrace();
			System.out.println(ex.getMessage());
		}
	}
	
	public static String saveByFee() throws Exception {
		String str = "~`~`~`~`2010-01-10 23:40:10~`~`~`1月份账单~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`1~`~`~`~`~`~`~`~`~@~#83~`2010-01-10 01:40:58~`2010-01-10 01:40:58~`~`~`300~`1~`1~`300~`300~`201~`11~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A1001~`报关费~`1~`代理商测试~`测试代理~`ATST~`202~`A0101~`收货重量应收~`C~`确定~`~@84~`2010-01-10 01:40:58~`2010-01-10 01:40:58~`~`~`0.12~`92~`1~`11.04~`11.04~`201~`1~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`202~`A0101~`收货重量应收~`C~`确定~`~@85~`2010-01-10 01:40:58~`2010-01-10 01:40:58~`~`~`184~`0.5~`1~`92~`92~`202~`0~`2010-01-07 22:53:02~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`202~`A0101~`收货重量应收~`C~`确定~`~@86~`2010-01-10 01:42:46~`2010-01-10 01:42:46~`~`~`300~`1~`1~`300~`300~`201~`11~`2010-01-07 22:38:19~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A1001~`报关费~`1~`代理商测试~`测试代理~`ATST~`204~`A0101~`收货重量应收~`C~`确定~`~@87~`2010-01-10 01:42:46~`2010-01-10 01:42:46~`~`~`0.12~`92~`1~`11.04~`11.04~`201~`1~`2010-01-07 22:38:19~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`204~`A0101~`收货重量应收~`C~`确定~`~@88~`2010-01-10 01:42:46~`2010-01-10 01:42:46~`~`~`184~`0.5~`1~`92~`92~`202~`0~`2010-01-07 22:38:19~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`204~`A0101~`收货重量应收~`C~`确定~`~@80~`2010-01-10 01:13:38~`2010-01-10 01:13:38~`~`~`0.12~`92~`1~`11.04~`11.04~`201~`1~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`167~`A0101~`收货重量应收~`C~`确定~`~@78~`2010-01-10 01:13:37~`2010-01-10 01:13:37~`~`~`300~`1~`1~`300~`300~`201~`11~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A1001~`报关费~`1~`代理商测试~`测试代理~`ATST~`167~`A0101~`收货重量应收~`C~`确定~`~@82~`2010-01-10 01:13:38~`2010-01-10 01:13:38~`~`~`184~`0.5~`1~`92~`92~`69~`0~`2010-01-07 22:53:02~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`167~`A0101~`收货重量应收~`C~`确定~`~@101~`2010-01-10 02:21:30~`2010-01-10 02:21:29~`~`~`184~`0.5~`1~`92~`92~`202~`0~`2010-01-07 22:53:02~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`221~`A0101~`收货重量应收~`C~`确定~`~@102~`2010-01-10 02:21:30~`2010-01-10 02:21:30~`~`~`300~`1~`1~`300~`300~`201~`11~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A1001~`报关费~`1~`代理商测试~`测试代理~`ATST~`221~`A0101~`收货重量应收~`C~`确定~`~@103~`2010-01-10 02:21:30~`2010-01-10 02:21:30~`~`~`0.12~`92~`1~`11.04~`11.04~`201~`1~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`221~`A0101~`收货重量应收~`C~`确定~`~@~#~`~@~#1~`~@~#";
		Decoder objPD = new Decoder(str);
		return s_objBillRecordService.saveByFee(objPD);
	}
	
	public static String saveByFee2() throws Exception
	{
		//		String str = "~`~`~`~`2010-08-24 16:41:32~`~`~`测试代理~`~`~`RMB~`~`~`~`~`~`~`~`~`~`~`1~`~`~`~`1~`~`~`~`~`~`A01~`~`~@~#12086~`2010-03-08 00:00:00~`2010-03-08 00:00:00~`~`~`240.36~`0.5~`1~`120.18~`120.18~`1294~`0~`2010-03-08 00:00:00~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`4484~`A0101~`收货重量应收~`C~`确定~`~@12085~`2010-03-08 00:00:00~`2010-03-08 00:00:00~`~`~`0.165~`120.18~`1~`19.83~`19.83~`4388~`1~`2010-03-08 00:00:00~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`4484~`A0101~`收货重量应收~`C~`确定~`~@~#~`~@~#19~`1~`50~`50~`2010-08-18 09:30:51~`2010-08-21 09:31:44~`2010-08-21 09:31:53~`2010-08-22 00:00:00~`~`21~`RMB~`人民币~`RMB~`~`~`~`~`~`~`C~`确定~`Confirm~`1~`XS001~`测试账号~`1~`XS001~`测试账号~`1~`XS001~`测试账号~`A1005~`特殊包装费~`1~`代理商测试~`测试代理~`ATST~`A01~`应收~`~@~#1~`~@~#";

		//old	String str = "~`~`~`~`2010-08-10 23:40:10~`~`~`8月份账单~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`1~`~`~`~`~`~`~`~`~@~#83~`2010-08-10 01:40:58~`2010-08-10 01:40:58~`~`~`300~`1~`1~`300~`300~`201~`11~`2010-08-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A1001~`报关费~`1~`代理商测试~`测试代理~`ATST~`202~`A0101~`收货重量应收~`C~`确定~`~@84~`2010-01-10 01:40:58~`2010-08-10 01:40:58~`~`~`0.12~`92~`1~`11.04~`11.04~`201~`1~`2010-08-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`202~`A0101~`收货重量应收~`C~`确定~`~@85~`2010-01-10 01:40:58~`2010-08-10 01:40:58~`~`~`184~`0.5~`1~`92~`92~`202~`0~`2010-08-07 22:53:02~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`202~`A0101~`收货重量应收~`C~`确定~`~@86~`2010-08-10 01:42:46~`2010-01-10 01:42:46~`~`~`300~`1~`1~`300~`300~`201~`11~`2010-08-07 22:38:19~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A1001~`报关费~`1~`代理商测试~`测试代理~`ATST~`204~`A0101~`收货重量应收~`C~`确定~`~@87~`2010-08-10 01:42:46~`2010-08-10 01:42:46~`~`~`0.12~`92~`1~`11.04~`11.04~`201~`1~`2010-08-07 22:38:19~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`204~`A0101~`收货重量应收~`C~`确定~`~@88~`2010-01-10 01:42:46~`2010-01-10 01:42:46~`~`~`184~`0.5~`1~`92~`92~`202~`0~`2010-01-07 22:38:19~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`204~`A0101~`收货重量应收~`C~`确定~`~@80~`2010-01-10 01:13:38~`2010-01-10 01:13:38~`~`~`0.12~`92~`1~`11.04~`11.04~`201~`1~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`167~`A0101~`收货重量应收~`C~`确定~`~@78~`2010-01-10 01:13:37~`2010-01-10 01:13:37~`~`~`300~`1~`1~`300~`300~`201~`11~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A1001~`报关费~`1~`代理商测试~`测试代理~`ATST~`167~`A0101~`收货重量应收~`C~`确定~`~@82~`2010-01-10 01:13:38~`2010-01-10 01:13:38~`~`~`184~`0.5~`1~`92~`92~`69~`0~`2010-01-07 22:53:02~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`167~`A0101~`收货重量应收~`C~`确定~`~@101~`2010-01-10 02:21:30~`2010-01-10 02:21:29~`~`~`184~`0.5~`1~`92~`92~`202~`0~`2010-01-07 22:53:02~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`221~`A0101~`收货重量应收~`C~`确定~`~@102~`2010-01-10 02:21:30~`2010-01-10 02:21:30~`~`~`300~`1~`1~`300~`300~`201~`11~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A1001~`报关费~`1~`代理商测试~`测试代理~`ATST~`221~`A0101~`收货重量应收~`C~`确定~`~@103~`2010-01-10 02:21:30~`2010-01-10 02:21:30~`~`~`0.12~`92~`1~`11.04~`11.04~`201~`1~`2010-01-07 22:53:02~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`221~`A0101~`收货重量应收~`C~`确定~`~@~#~`~@~#~`1~`10~`10~`2010-08-16 17:33:33~`2010-08-16 17:33:33~`2010-08-16 17:33:33~`~`1~`remark~`RMB~`~`~`812~`1145~`~`~`~`~`P~`~`~`~`~`~`~`~`~`~`~`~`A1010~`~`338~`~`A0101~`~`~@~#1~`~@~#";
		
		String str = "~`~`~`~`2010-08-24 16:41:32~`~`~`测试代理~`~`~`RMB~`~`~`~`~`~`~`~`~`~`~`1~`~`~`~`1~`~`~`~`~`~`A01~`~`~@~#12086~`2010-03-08 00:00:00~`2010-03-08 00:00:00~`~`~`240.36~`0.5~`1~`120.18~`120.18~`1294~`0~`2010-03-08 00:00:00~`0~`~`系统自动计费~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0101~`快递运费~`1~`代理商测试~`测试代理~`ATST~`4484~`A0101~`收货重量应收~`C~`确定~`~@12085~`2010-03-08 00:00:00~`2010-03-08 00:00:00~`~`~`0.165~`120.18~`1~`19.83~`19.83~`4388~`1~`2010-03-08 00:00:00~`0~`~`~`RMB~`人民币~`~`~`~`~`0~`系统管理员~`0~`系统管理员~`~`~`A0102~`燃油附加费~`1~`代理商测试~`测试代理~`ATST~`4484~`A0101~`收货重量应收~`C~`确定~`~@~#~`~@~#22~`10~`100~`100~`2010-08-26 17:33:33~`~`2010-08-26 17:33:33~`~`~`remark1~`RMB~`~`~`~`~`~`~`~`~`P~`~`~`~`~`~`~`~`~`~`~`~`A1010~`~`338~`~`~`~`A0101~`~`~@~#1~`~@~#";
		
		
		Decoder objPD = new Decoder(str);
		return s_objBillRecordService.saveByFee(objPD);
	}
	
	public static String query() throws Exception{
		String str ="~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`216300~`~`~`~`~`~`~`~`~`~@~#";
		Decoder objPD = new Decoder(str);
		return s_objBillRecordService.queryForBill(objPD);
	}
	
	public static String sumActualTotal() throws Exception {
		BillrecordCondition objBillrecordCondition = new BillrecordCondition();
		objBillrecordCondition.setBrid("779035");
		//objBillrecordCondition.setStartoccurdate("2014-05-12");
		//objBillrecordCondition.setNotinbrscode("E");
		List results = BillRecordDemand.query(objBillrecordCondition);
		for (int i = 0; i < results.size(); i++) {
			BillrecordColumns objBillrecordColumns = (BillrecordColumns)results.get(i);
			BillRecordAmountTH obj = new BillRecordAmountTH(); 
			obj.setParam(objBillrecordColumns.getCococode(), 
					objBillrecordColumns.getBrbrid(), 
					objBillrecordColumns.getBkbkcode());
			obj.run();
			
			/*
			System.out.println("记账金额对不上 " + 
					objBillrecordColumns.getBrbrid() + 
					"  账单上的记账金额：" + objBillrecordColumns.getBrbragencyfeetotal() +
					" 统计金额:" + obj.getAccountingonlyAmount());
			
			System.out.println("记账金额对不上 " + 
					objBillrecordColumns.getBrbrid() + 
					"  账单上的记账金额：" + objBillrecordColumns.getBrbrtotal() +
					" 统计金额:" + obj.getAccountAmount());
			
			if (!StringUtility.isNull(objBillrecordColumns.getBrbragencyfeetotal()) &&
					!objBillrecordColumns.getBrbragencyfeetotal().equals(obj.getAccountingonlyAmount())) {
				System.out.println("记账金额对不上 " + 
						objBillrecordColumns.getBrbrid() + 
						"  账单上的记账金额：" + objBillrecordColumns.getBrbragencyfeetotal() +
						" 统计金额:" + obj.getAccountingonlyAmount());
			}
			if (!StringUtility.isNull(objBillrecordColumns.getBrbrtotal()) &&
					!objBillrecordColumns.getBrbrtotal().equals(obj.getAccountAmount())) {
				System.out.println("记账金额对不上 " + 
						objBillrecordColumns.getBrbrid() + 
						"  账单上的记账金额：" + objBillrecordColumns.getBrbrtotal() +
						" 统计金额:" + obj.getAccountAmount());
			}	
			*/		
		}
		return "";
	}
	
}
